recover_udisk.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-13 日 16:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>记一次帮老师修U盘</title>
<meta name="author" content="dongdigua" />
<meta name="description" content="驱动器 F 中的磁盘未格式化, 想现在格式化吗?" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='css/main.css' />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./../posts"> UP </a>
 |
 <a accesskey="H" href="https://dongdigua.github.io"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">记一次帮老师修U盘</h1>

<div class="outline-2">
<h2>发生甚么事了</h2>
<div class="outline-text-2">
<p>
老师上课放(U盘里)视频的时候 "啪" 把U盘拔了!<br />
下一次插上就提示 "是否格式化" :)<br />
反正闲时间太多, 我就准备试试给修复一下, 使用我在我文具盒里待了两年的工具箱: <a href="https://www.ventoy.net">Ventoy</a> 启动盘<br />
</p>
</div>
</div>

<div class="outline-2">
<h2>咋整</h2>
<div class="outline-text-2">
<p>
我首先是对 Linux 文件系统有一定基础, 也进行过不少操作(如多次安装gentoo和arch)<br />
也搞过一些文件系统损坏的事(比如调分区坏过C盘), 还算有经验<br />
</p>

<p>
于是我上老师电脑启动了两年前放在工具箱盘里的 Fedora Workstation 34<br />
</p>
</div>

<div class="outline-3">
<h3>第一次尝试</h3>
<div class="outline-text-3">
<p>
把老师的U盘插上, "嘎嗒"一声熟悉的 gnome 提示音, U盘没显示<br />
有 <code>/dev/sdc</code><br />
<code>mount -t</code> 试试? 是不是没文件系统坏了没识别? 不是<br />
<code>fsck</code> 试试? 不行<br />
嗯??? 似乎有点超出我的知识储备和经验了<br />
</p>
</div>
</div>
<div class="outline-3">
<h3>第二次尝试</h3>
<div class="outline-text-3">
<p>
只有一个整盘, 没有分区号? 凭直觉, 我觉得那就是分区表坏了<br />
然后查了一下(当然用英文查), 有没有能修复分区表的? <a href="https://www.cgsecurity.org">testdisk</a><br />
然后先用 <code>dd</code> 整盘备份一下, 跑 testdisk<br />
很简单就把分区表恢复出来了!<br />
</p>

<p>
那就开始拷文件吧&#x2026;"文件不完整"<br />
</p>
</div>
</div>
<div class="outline-3">
<h3>第三次尝试</h3>
<div class="outline-text-3">
<p>
和 testdisk 一家的软件还有 <code>photorec</code>, 我似乎在 <a href="https://linux.cn">linuxcn</a> 见过(懒得去找链接了)<br />
这东西一看就知道是通过文件头来识别并恢复文件的<br />
那就跑呗<br />
一节课之后, 文件(和曾经被删除的)都回来了<br />
开心!<br />
</p>
</div>
</div>
</div>

<div id="outline-container-ad" class="outline-2">
<h2 id="ad">接活?</h2>
<div class="outline-text-2" id="text-ad">
<p>
我可以比较廉价的进行数据恢复<br />
联系我后将磁盘镜像传到 FTP 服务器, <b>不接百度网盘</b><br />
暂定价如下:<br />
</p>
</div>
<div class="outline-3">
<h3>16GiB 以下 0.3 XMR</h3>
</div>
<div class="outline-3">
<h3>16~64GiB 0.5 XMR</h3>
</div>
</div>

<div class="outline-2">
<h2>后续</h2>
<div class="outline-text-2">
</div>
</div>
</div>
<div id="postamble" class="status">

<p class="author">Author: dongdigua</p>
<p class="date">Date: 2022-11-13 日 00:00</p>
<p class="date">Build: 2022-11-13 日 16:53</p>
</div>
</body>
</html>
